# Built In Failures Reshape From Facets Failures Class

Source: https://www.revitapidocs.com/2026/0f1055dc-5f51-28b9-fd15-b73bab2cdb19.htm

---

| Built In Failures Reshape From Facets Failures Class |
| --- |

Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures ReshapeFromFacetsFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class ReshapeFromFacetsFailures
```

```
Public NotInheritable Class ReshapeFromFacetsFailures
```

```
public ref class ReshapeFromFacetsFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ReshapeFromFacetsFailures = class end
```
The BuiltInFailures ReshapeFromFacetsFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ReshapeFromFacetsFailed | Reshape from facets failed. \[Description] |
|  | ReshapeFromFacetsFailedError | Reshape from facets failed. \[Description] |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace